In [5]:
import pandas as pd
import os
os.getcwd()

'/Users/chance/Desktop/데이터시각화'

In [2]:
pd.Series([30, 34, 20], name="age")

0    30
1    34
2    20
Name: age, dtype: int64

In [25]:
df = pd.DataFrame({"name" : ["Park", "Kim", "Lee"],
                   "age" : [25, 30, 28]})
df

   name  age
0  Park   25
1   Kim   30
2   Lee   28

In [10]:
iris = pd.read_csv("./data/iris.csv")
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [17]:
iris.index
iris.columns
iris.dtypes
iris.values
iris.shape
iris.size

750

In [23]:
iris.iloc[0, :]
iris.iloc[:, 0:2]

     Sepal.Length  Sepal.Width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [30]:
df.loc[:, "age"]
df.loc[:, "name"]
df.loc[0, :]

name    Park
age       25
Name: 0, dtype: object

In [35]:
df2 = df.set_index("name")
df2.loc["Park", "age"]
df2.loc[:, "age"]
df2.age
df2.loc[df2.loc[:, "age"] > 27, :]

      age
name
Kim    30
Lee    28

In [37]:
iris.head()
iris.tail(10)
iris.describe()
df.describe()

             age
count   3.000000
mean   27.666667
std     2.516611
min    25.000000
25%    26.500000
50%    28.000000
75%    29.000000
max    30.000000